In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "Name":['Hashir','Sultan','Naini'],
    "Marks": [80,50,20],
    "City" : ['Muzaffargarh','Gujrat','Hyderabad']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     Name  Marks          City
0  Hashir     80  Muzaffargarh
1  Sultan     50        Gujrat
2   Naini     20     Hyderabad

*Rows are represented by **indexes** and columns are represented as **column names***

# To Export data to CSV file:

In [5]:
df.to_csv('friends.csv')

# If we don't want index:

In [6]:
df.to_csv('friends.csv',index=False)

# If we want to see first / last two rows only:

In [7]:
df.head(2)

     Name  Marks          City
0  Hashir     80  Muzaffargarh
1  Sultan     50        Gujrat

In [8]:
df.tail(2)

     Name  Marks       City
1  Sultan     50     Gujrat
2   Naini     20  Hyderabad

# To see statistical analysis of numeric data:

In [9]:
df.describe()

       Marks
count    3.0
mean    50.0
std     30.0
min     20.0
25%     35.0
50%     50.0
75%     65.0
max     80.0

# Read a CSV File

In [10]:
harry=pd.read_csv('Trains.csv')

In [11]:
harry

,Unnamed: 0.14,Unnamed: 0.13,Unnamed: 0.12,Unnamed: 0.11,Unnamed: 0.10,Unnamed: 0.9,Unnamed: 0.8,Unnamed: 0.7,Unnamed: 0.6,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No,Speed,Destination
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,22444,345,Muzaffargarh
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,55898,150,Gujrat
2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,6657,200,Hyderabad

# To get only column

In [12]:
harry['Speed']

0    345
1    150
2    200
Name: Speed, dtype: int64

*To get column at certain index:*

In [13]:
harry['Speed'][0]

345

# To change a value in CSV file

*+ First you have to read the file*

In [14]:
harry['Speed'][0]=345

C:\Users\HASHIR\AppData\Local\Temp\ipykernel_5804\860565992.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][0]=345

In [15]:
harry

,Unnamed: 0.14,Unnamed: 0.13,Unnamed: 0.12,Unnamed: 0.11,Unnamed: 0.10,Unnamed: 0.9,Unnamed: 0.8,Unnamed: 0.7,Unnamed: 0.6,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No,Speed,Destination
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,22444,345,Muzaffargarh
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,55898,150,Gujrat
2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,6657,200,Hyderabad

*Changed value at index 0*

In [16]:
harry.to_csv('Trains.csv')

# To change the index

In [17]:
harry.index=['first','second','third']

In [18]:
harry

,Unnamed: 0.14,Unnamed: 0.13,Unnamed: 0.12,Unnamed: 0.11,Unnamed: 0.10,Unnamed: 0.9,Unnamed: 0.8,Unnamed: 0.7,Unnamed: 0.6,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No,Speed,Destination
first,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,22444,345,Muzaffargarh
second,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,55898,150,Gujrat
third,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,6657,200,Hyderabad

# Pandas Series:

In [19]:
ser=pd.Series(np.random.rand(34))

In [20]:
ser

0     0.490488
1     0.461985
2     0.175729
3     0.707281
4     0.659692
5     0.856096
6     0.115918
7     0.462859
8     0.685072
9     0.285929
10    0.884224
11    0.344066
12    0.209257
13    0.613920
14    0.454522
15    0.323490
16    0.649767
17    0.321534
18    0.752079
19    0.123320
20    0.852508
21    0.281675
22    0.608348
23    0.196498
24    0.732923
25    0.735868
26    0.065540
27    0.284647
28    0.517110
29    0.374100
30    0.052955
31    0.502897
32    0.783332
33    0.312272
dtype: float64

*Check it's Type:*

In [21]:
type(ser)

pandas.core.series.Series

# Make Series's Data Frame

In [22]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [23]:
newdf

            0         1         2         3         4
0    0.758507  0.748895  0.218383  0.933929  0.577327
1    0.450295  0.464547  0.651076  0.324801  0.733264
2    0.189632  0.335933  0.578361  0.742072  0.055315
3    0.285339  0.389210  0.232521  0.310403  0.966078
4    0.334091  0.047684  0.876100  0.083725  0.470397
..        ...       ...       ...       ...       ...
329  0.513628  0.532974  0.130179  0.832103  0.630622
330  0.036774  0.322895  0.503665  0.872864  0.806835
331  0.094525  0.390939  0.458115  0.084138  0.005681
332  0.083795  0.873162  0.739991  0.926915  0.892499
333  0.321362  0.719313  0.231858  0.202792  0.336732

[334 rows x 5 columns]

In [24]:
type(newdf)

pandas.core.frame.DataFrame

In [25]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.483391    0.508635    0.490238    0.499162    0.502385
std      0.305506    0.280067    0.293337    0.286824    0.295164
min      0.002914    0.010463    0.001121    0.000067    0.003208
25%      0.211938    0.278918    0.236802    0.225190    0.252706
50%      0.450928    0.518573    0.475532    0.491566    0.502081
75%      0.770664    0.738664    0.756293    0.761662    0.762036
max      0.999817    0.979957    0.999355    0.997177    0.999628

# Shows the Data Type of rows:

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

*If I change first row's first element to string then it will change data type to object*

In [27]:
newdf[0][0]="Pika"

C:\Users\HASHIR\AppData\Local\Temp\ipykernel_5804\1377992579.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Pika' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Pika"

In [28]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

***See It changed to object***

# How to change a dataframe to numpy array:

In [29]:
newdf.to_numpy()

array([['Pika', 0.7488953887630437, 0.21838319782651827,
        0.9339287554988447, 0.5773273747841968],
       [0.4502946034685785, 0.46454722004813853, 0.6510762898452945,
        0.32480073108592844, 0.7332636490875806],
       [0.18963161510381998, 0.3359333196416603, 0.5783607406726521,
        0.7420724300062241, 0.055315155103207725],
       ...,
       [0.0945246261573709, 0.3909388958019919, 0.4581151782771128,
        0.08413802080095678, 0.005680779995341889],
       [0.08379537301536188, 0.8731621228561441, 0.7399912687099229,
        0.9269146284027375, 0.8924992140108479],
       [0.3213618825524054, 0.7193134901336294, 0.23185763318115982,
        0.202792236901832, 0.33673228775749076]], dtype=object)

***It is showing the dtype=object because of first string entry ( Pika )***

# Benefit to create it as numpy Array:

***1 - You can take Transpose of whole dataframe***

In [30]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Pika,0.450295,0.189632,0.285339,0.334091,0.944163,0.77723,0.203345,0.521256,0.160199,...,0.675929,0.366473,0.521082,0.07393,0.689019,0.513628,0.036774,0.094525,0.083795,0.321362
1,0.748895,0.464547,0.335933,0.38921,0.047684,0.110801,0.370669,0.853331,0.348203,0.721145,...,0.327521,0.076126,0.411677,0.485092,0.033804,0.532974,0.322895,0.390939,0.873162,0.719313
2,0.218383,0.651076,0.578361,0.232521,0.8761,0.220325,0.738194,0.262369,0.216393,0.934133,...,0.55767,0.781421,0.321584,0.863503,0.955093,0.130179,0.503665,0.458115,0.739991,0.231858
3,0.933929,0.324801,0.742072,0.310403,0.083725,0.438155,0.018127,0.784523,0.916305,0.939323,...,0.305299,0.382939,0.573858,0.211164,0.481763,0.832103,0.872864,0.084138,0.926915,0.202792
4,0.577327,0.733264,0.055315,0.966078,0.470397,0.337468,0.261794,0.163839,0.648069,0.213783,...,0.674041,0.876594,0.653979,0.649483,0.334253,0.630622,0.806835,0.005681,0.892499,0.336732

***Previously it was 334 rows and 5 columns, Now It have 5 rows and 334 columns becuase we took transpose***

***2- Sort the array ascending or descending***

*Descending:*

In [31]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.321362  0.719313  0.231858  0.202792  0.336732
332  0.083795  0.873162  0.739991  0.926915  0.892499
331  0.094525  0.390939  0.458115  0.084138  0.005681
330  0.036774  0.322895  0.503665  0.872864  0.806835
329  0.513628  0.532974  0.130179  0.832103  0.630622
..        ...       ...       ...       ...       ...
4    0.334091  0.047684  0.876100  0.083725  0.470397
3    0.285339  0.389210  0.232521  0.310403  0.966078
2    0.189632  0.335933  0.578361  0.742072  0.055315
1    0.450295  0.464547  0.651076  0.324801  0.733264
0        Pika  0.748895  0.218383  0.933929  0.577327

[334 rows x 5 columns]

*Ascending:*

In [32]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0        Pika  0.748895  0.218383  0.933929  0.577327
1    0.450295  0.464547  0.651076  0.324801  0.733264
2    0.189632  0.335933  0.578361  0.742072  0.055315
3    0.285339  0.389210  0.232521  0.310403  0.966078
4    0.334091  0.047684  0.876100  0.083725  0.470397
..        ...       ...       ...       ...       ...
329  0.513628  0.532974  0.130179  0.832103  0.630622
330  0.036774  0.322895  0.503665  0.872864  0.806835
331  0.094525  0.390939  0.458115  0.084138  0.005681
332  0.083795  0.873162  0.739991  0.926915  0.892499
333  0.321362  0.719313  0.231858  0.202792  0.336732

[334 rows x 5 columns]

*Sorting in column,,, Just add axis=1*

In [33]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.577327  0.933929  0.218383  0.748895      Pika
1    0.733264  0.324801  0.651076  0.464547  0.450295
2    0.055315  0.742072  0.578361  0.335933  0.189632
3    0.966078  0.310403  0.232521  0.389210  0.285339
4    0.470397  0.083725  0.876100  0.047684  0.334091
..        ...       ...       ...       ...       ...
329  0.630622  0.832103  0.130179  0.532974  0.513628
330  0.806835  0.872864  0.503665  0.322895  0.036774
331  0.005681  0.084138  0.458115  0.390939  0.094525
332  0.892499  0.926915  0.739991  0.873162  0.083795
333  0.336732  0.202792  0.231858  0.719313  0.321362

[334 rows x 5 columns]

In [34]:
newdf.head()

          0         1         2         3         4
0      Pika  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264
2  0.189632  0.335933  0.578361  0.742072  0.055315
3  0.285339  0.389210  0.232521  0.310403  0.966078
4  0.334091  0.047684  0.876100  0.083725  0.470397

In [35]:
type(newdf[0])

pandas.core.series.Series

***It means when we get column it returns a Series***

*-------------------------------------------------------------------------------------------*

# To copy a df variable to another vaiable

In [36]:
newdf2 = newdf

In [37]:
newdf2[0][0]=223

C:\Users\HASHIR\AppData\Local\Temp\ipykernel_5804\1463849847.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=223

*Now check the original var ,,, am writing .head() because i don't want to see full data*

In [38]:
newdf.head()

          0         1         2         3         4
0       223  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264
2  0.189632  0.335933  0.578361  0.742072  0.055315
3  0.285339  0.389210  0.232521  0.310403  0.966078
4  0.334091  0.047684  0.876100  0.083725  0.470397

**See, It didn't made a copy..it is like a view but not a copy**

**To make it a copy, you should do this:**

In [39]:
newdf2=newdf.copy()

In [40]:
newdf2[0][0]="Pikaboo"

C:\Users\HASHIR\AppData\Local\Temp\ipykernel_5804\436856873.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]="Pikaboo"

In [41]:
newdf.head()

          0         1         2         3         4
0       223  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264
2  0.189632  0.335933  0.578361  0.742072  0.055315
3  0.285339  0.389210  0.232521  0.310403  0.966078
4  0.334091  0.047684  0.876100  0.083725  0.470397

**See, it didn't changed the original one**

In [42]:
newdf.head(2)

          0         1         2         3         4
0       223  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264

# LOC Function

In [43]:
newdf.columns = list("ABCDE")

In [44]:
newdf.loc[0,'A'] = 65445

In [45]:
newdf.head()

          A         B         C         D         E
0     65445  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264
2  0.189632  0.335933  0.578361  0.742072  0.055315
3  0.285339  0.389210  0.232521  0.310403  0.966078
4  0.334091  0.047684  0.876100  0.083725  0.470397

***See it changed the first element of 0th row and A column***

# To get the specific column and row:

**Where we used to write [ 0 , 0 ]  we will make it like [ [ row , row ] , [ col , col ] ]**

In [46]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.651076  0.324801
2  0.578361  0.742072

# If we want all rows or all columns:

**If we want all rows with C and D columns then we will replace [1,2] with :**

In [47]:
newdf.loc[:,['C','D']]

            C         D
0    0.218383  0.933929
1    0.651076  0.324801
2    0.578361  0.742072
3    0.232521  0.310403
4    0.876100  0.083725
..        ...       ...
329  0.130179  0.832103
330  0.503665  0.872864
331  0.458115  0.084138
332  0.739991  0.926915
333  0.231858  0.202792

[334 rows x 2 columns]

**Same goes with columns...If we want all columns within given rows we will replace ['C','D'] with :**

In [48]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.450295  0.464547  0.651076  0.324801  0.733264
2  0.189632  0.335933  0.578361  0.742072  0.055315

**to include only the rows where the values in column 'A' are less than 0.3**

In [49]:
newdf.loc[(newdf['A']<0.5)]

            A         B         C         D         E
1    0.450295  0.464547  0.651076  0.324801  0.733264
2    0.189632  0.335933  0.578361  0.742072  0.055315
3    0.285339  0.389210  0.232521  0.310403  0.966078
4    0.334091  0.047684  0.876100  0.083725  0.470397
7    0.203345  0.853331  0.262369  0.784523  0.163839
..        ...       ...       ...       ...       ...
327   0.07393  0.485092  0.863503  0.211164  0.649483
330  0.036774  0.322895  0.503665  0.872864  0.806835
331  0.094525  0.390939  0.458115  0.084138  0.005681
332  0.083795  0.873162  0.739991  0.926915  0.892499
333  0.321362  0.719313  0.231858  0.202792  0.336732

[176 rows x 5 columns]

**We can add more conditions to it...**

In [50]:
newdf.loc[(newdf['A']<0.5) & newdf['C']>0.2]

            A         B         C         D         E
1    0.450295  0.464547  0.651076  0.324801  0.733264
2    0.189632  0.335933  0.578361  0.742072  0.055315
3    0.285339  0.389210  0.232521  0.310403  0.966078
4    0.334091  0.047684  0.876100  0.083725  0.470397
7    0.203345  0.853331  0.262369  0.784523  0.163839
..        ...       ...       ...       ...       ...
327   0.07393  0.485092  0.863503  0.211164  0.649483
330  0.036774  0.322895  0.503665  0.872864  0.806835
331  0.094525  0.390939  0.458115  0.084138  0.005681
332  0.083795  0.873162  0.739991  0.926915  0.892499
333  0.321362  0.719313  0.231858  0.202792  0.336732

[176 rows x 5 columns]

# To get value from index:

*Firstly let me show you the data:*

In [51]:
newdf.head(2)

          A         B         C         D         E
0     65445  0.748895  0.218383  0.933929  0.577327
1  0.450295  0.464547  0.651076  0.324801  0.733264

***Now to Implement the function:***

In [52]:
newdf.iloc[0,4]

0.5773273747841968

***It started from 0th row and counted to 4 in columns and at E it got 0.4895..***

# So what is the Crux???

# We learned that if we want to get any col/row from the name, we can use previous method(.loc[ ]), But if we want to get the value from it's index we can use iloc function

*If we have indexes in rows like 0,1,2,3,4,5 and columns A,B,C,D,E    & we give loc[0,1], it will give error and we have to enter A,B or any other index inm order to get the value*

**But in the case of iloc if we give it like loc[0,1] it will give us 0th row and B column , because it sounts index to 1 , it doesn't care about column/row name**

# If we want to Delete a row

   *We use dop() Function*

In [53]:
newdf.drop(2)

            A         B         C         D         E
0       65445  0.748895  0.218383  0.933929  0.577327
1    0.450295  0.464547  0.651076  0.324801  0.733264
3    0.285339  0.389210  0.232521  0.310403  0.966078
4    0.334091  0.047684  0.876100  0.083725  0.470397
5    0.944163  0.110801  0.220325  0.438155  0.337468
..        ...       ...       ...       ...       ...
329  0.513628  0.532974  0.130179  0.832103  0.630622
330  0.036774  0.322895  0.503665  0.872864  0.806835
331  0.094525  0.390939  0.458115  0.084138  0.005681
332  0.083795  0.873162  0.739991  0.926915  0.892499
333  0.321362  0.719313  0.231858  0.202792  0.336732

[333 rows x 5 columns]

***It deleted the 2nd row***

# To delete the column:

In [54]:
newdf.drop('A',axis=1)

            B         C         D         E
0    0.748895  0.218383  0.933929  0.577327
1    0.464547  0.651076  0.324801  0.733264
2    0.335933  0.578361  0.742072  0.055315
3    0.389210  0.232521  0.310403  0.966078
4    0.047684  0.876100  0.083725  0.470397
..        ...       ...       ...       ...
329  0.532974  0.130179  0.832103  0.630622
330  0.322895  0.503665  0.872864  0.806835
331  0.390939  0.458115  0.084138  0.005681
332  0.873162  0.739991  0.926915  0.892499
333  0.719313  0.231858  0.202792  0.336732

[334 rows x 4 columns]

***It deleted the 1st column***

# If we want to change it for real ... there are two methods ...

**No 1 is we do this : newdf = newdf .drop ( 'A' , axis = 1)**

**No 2 is:**

In [55]:
newdf.drop('A',axis=1,inplace=True)

In [56]:
newdf

            B         C         D         E
0    0.748895  0.218383  0.933929  0.577327
1    0.464547  0.651076  0.324801  0.733264
2    0.335933  0.578361  0.742072  0.055315
3    0.389210  0.232521  0.310403  0.966078
4    0.047684  0.876100  0.083725  0.470397
..        ...       ...       ...       ...
329  0.532974  0.130179  0.832103  0.630622
330  0.322895  0.503665  0.872864  0.806835
331  0.390939  0.458115  0.084138  0.005681
332  0.873162  0.739991  0.926915  0.892499
333  0.719313  0.231858  0.202792  0.336732

[334 rows x 4 columns]

**see it changed the original one**

# what to do if we changed the index and want to reset it:

In [57]:
newdf.reset_index()

     index         B         C         D         E
0        0  0.748895  0.218383  0.933929  0.577327
1        1  0.464547  0.651076  0.324801  0.733264
2        2  0.335933  0.578361  0.742072  0.055315
3        3  0.389210  0.232521  0.310403  0.966078
4        4  0.047684  0.876100  0.083725  0.470397
..     ...       ...       ...       ...       ...
329    329  0.532974  0.130179  0.832103  0.630622
330    330  0.322895  0.503665  0.872864  0.806835
331    331  0.390939  0.458115  0.084138  0.005681
332    332  0.873162  0.739991  0.926915  0.892499
333    333  0.719313  0.231858  0.202792  0.336732

[334 rows x 5 columns]

*It reset to index but it added an column named index*

*How to fix it:*

In [58]:
newdf.reset_index(drop=True , inplace=True)

*I used *inplace = True* here to make changes in original ... Let's check df now:*

In [59]:
newdf.head(3)

          B         C         D         E
0  0.748895  0.218383  0.933929  0.577327
1  0.464547  0.651076  0.324801  0.733264
2  0.335933  0.578361  0.742072  0.055315

***See it deleted The index named column***

# To get that where is NULL value in df:

***We give it a column and use .isnull function to get nulls***

*Firstly we make the column B all NULL By:*

In [60]:
newdf.loc[:,'B'] = None

In [61]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: B, Length: 334, dtype: bool

In [62]:
newdf['C'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: C, Length: 334, dtype: bool

*See in Column B where all values are NULL, it returns True and viceversa*

# To delete rows that contain NULL

*Let's take an example of dataframe:*

In [85]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [86]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [87]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

***It deleted all rows that had Na values***

In [88]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT],
                   "height":[np.nan, np.nan,np.nan]})

In [92]:
df.head()

       name        toy       born  height
0    Alfred        NaN        NaT     NaN
1    Batman  Batmobile 1940-04-25     NaN
2  Catwoman   Bullwhip        NaT     NaN

# If we only want to delete those columns in which all values are Na:

In [93]:
df.dropna(how='all',axis=1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [98]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [99]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

# If we want to drop Duplicates:

In [100]:
df.drop_duplicates(subset='name')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

*See it removed the duplicate value Alfred*

***what if we want to delete first row's duplicate -> not second line ???    We can use keep function:***

In [102]:
df.drop_duplicates(subset='name',keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

*To drop first row , Just Replace last with 'first'*

***Or you can remove both rows by: keep=False***

In [103]:
df.drop_duplicates(subset='name',keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [104]:
df['name'].value_counts(dropna=False)

name
Alfred    2
Batman    1
Name: count, dtype: int64